src/cf/InformationRegisters/МестаХраненияНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>МестаХраненияНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/МестаХраненияНоменклатуры/Ext/RecordSetModule.bsl
// Процедура вызывается перед записью набора регистра сведений
//
Процедура ПередЗаписью(Отказ, Замещение)

	Если НЕ ОбменДанными.Загрузка Тогда

		Для каждого ЗаписьРегистра Из ЭтотОбъект Цикл

			Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.Номенклатура) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Номенклатура должна быть заполнена обязательно!", Отказ);
			ИначеЕсли ЗаписьРегистра.Номенклатура.Услуга Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Номенклатура не может быть услугой!", Отказ);
			КонецЕсли;

			Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.Склад) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Склад должен быть заполнена обязательно!", Отказ);
			КонецЕсли;

			Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.МестоХранения) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Место хранения должно быть заполнена обязательно!", Отказ);
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры
